nfelib/mdfe/wsdl/v3_0/mdfedistribuicaodfe.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeDistribuicaoDFe" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" targetNamespace="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeDistribuicaoDFe" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <s:schema elementFormDefault="qualified" targetNamespace="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeDistribuicaoDFe">
      <s:element name="mdfeDadosMsg">
        <s:complexType mixed="true">
          <s:sequence>
            <s:any />
          </s:sequence>
        </s:complexType>
      </s:element>
      <s:element name="mdfeDistDFeInteresseResult">
        <s:complexType mixed="true">
          <s:sequence>
            <s:any />
          </s:sequence>
        </s:complexType>
      </s:element>
      <s:element name="mdfeCabecMsg" type="tns:mdfeCabecMsg" />
      <s:complexType name="mdfeCabecMsg">
        <s:sequence>
          <s:element minOccurs="0" maxOccurs="1" name="cUF" type="s:string" />
          <s:element minOccurs="0" maxOccurs="1" name="versaoDados" type="s:string" />
        </s:sequence>
        <s:anyAttribute />
      </s:complexType>
    </s:schema>
  </wsdl:types>
  <wsdl:message name="mdfeDistDFeInteresseSoap12In">
    <wsdl:part name="mdfeDadosMsg" element="tns:mdfeDadosMsg" />
  </wsdl:message>
  <wsdl:message name="mdfeDistDFeInteresseSoap12Out">
    <wsdl:part name="mdfeDistDFeInteresseResult" element="tns:mdfeDistDFeInteresseResult" />
  </wsdl:message>
  <wsdl:message name="mdfeDistDFeInteressemdfeCabecMsg">
    <wsdl:part name="mdfeCabecMsg" element="tns:mdfeCabecMsg" />
  </wsdl:message>
  <wsdl:portType name="MDFeDistribuicaoDFeSoap12">
    <wsdl:operation name="mdfeDistDFeInteresse">
      <wsdl:input message="tns:mdfeDistDFeInteresseSoap12In" />
      <wsdl:output message="tns:mdfeDistDFeInteresseSoap12Out" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="MDFeDistribuicaoDFeSoap12" type="tns:MDFeDistribuicaoDFeSoap12">
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="mdfeDistDFeInteresse">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeDistribuicaoDFe/mdfeDistDFeInteresse" style="document" />
      <wsdl:input>
        <soap12:body use="literal" />
        <soap12:header message="tns:mdfeDistDFeInteressemdfeCabecMsg" part="mdfeCabecMsg" use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal" />
        <soap12:header message="tns:mdfeDistDFeInteressemdfeCabecMsg" part="mdfeCabecMsg" use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="MDFeDistribuicaoDFe">
    <wsdl:port name="MDFeDistribuicaoDFeSoap12" binding="tns:MDFeDistribuicaoDFeSoap12">
      <soap12:address location="https://mdfe.svrs.rs.gov.br/ws/MDFeDistribuicaoDFe/MDFeDistribuicaoDFe.asmx" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>