backend/templates/mdfeDistribuicaoDFeSoap.msg

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:mdf="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeDistribuicaoDFe"><soap:Header><mdf:mdfeCabecMsg><mdf:cUF>$cUFAutor</mdf:cUF><mdf:versaoDados>1.00</mdf:versaoDados></mdf:mdfeCabecMsg></soap:Header><soap:Body><mdf:mdfeDadosMsg><distDFeInt versao="1.00" xmlns="http://www.portalfiscal.inf.br/mdfe"><tpAmb>$tpAmb</tpAmb><CNPJ>$CNPJ</CNPJ><distNSU><ultNSU>$ultNSU</ultNSU></distNSU></distDFeInt></mdf:mdfeDadosMsg></soap:Body></soap:Envelope>